app/controllers/songs_controller.rb

  def index
    if params[:term]
      @songs = Song.search(params[:term])
---
SELECT "songs".* FROM "songs"

  def show
    @user = current_user
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = current_user
    @song = Song.new(song_params)
    @song.user = current_user

    if @song.save
---
INSERT INTO "songs" ("name", "artist", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @song = Song.find(params[:id])

    if @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "songs" SET "description" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["description", "An awesome song I just rediscovered. I just edited this."], ["updated_at", 2017-01-31 18:27:37 UTC], ["id", 1]]

  def destroy
    @song = Song.find(params[:id])
    @user = current_user

    if @user.id == @song.user_id || @user.admin?
      Song.destroy(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]